<template>
  <div id="main-app">
    <div @click="listOpen(index)" class="main-app-item" v-for="(item, index) in list">
      <div class="main-app-item-1">
        <div class="main-app-item-title">
          {{ item.title }}
        </div>
        <transition name="slide" mode="out-in">
          <div class="modale-wrong-item-add" v-if="!item.isActive" :key="index">+</div>
          <div class="modale-wrong-item-add" v-else  :key="index + 999">-</div>
        </transition>
      </div>
      <div v-show="item.isActive" class="main-app-item-2">
        <p>{{ item.content }}</p>
      </div>
    </div>
  </div>
</template>

<script>

import { mapGetters } from 'vuex'

export default {
  name: 'plan',
  components: {

  },
  data () {
    return {
      list: [
        {
          title: 'Лояльная программа пользования',
          isActive: false,
          content: 'Программа лояльности — комплекс маркетинговых мероприятий для развития повторных продаж существующим клиентам в будущем, продажи им дополнительных товаров и услуг, продвижения корпоративных идей и ценностей, других видов потенциально прибыльного поведения. Проводится, в основном, на этапе зрелости жизненного цикла товара. Типичным примером программы лояльности компании является дисконтная карта, при дальнейших покупках с использованием дисконтной карты могут предоставляться скидки, в том числе по накопительной системе, также могут существовать системы бонусов и подарков. Кроме того, при получении подобных карт, как правило, заполняется анкета, в которой указываются контакты получателя, что даёт организации возможность оповещать покупателя о новых и потенциально интересующих его товарах и услугах. Для автоматизированного анализа клиентского поведения и управления используются CRM-системы. При глубинном анализе данных о покупках, совершаемых клиентом, возможно выявление товаров и услуг, в которых потенциально заинтересован клиент. Например, онлайн-магазин на основании анализа покупок клиента может показывать авторизованному пользователю список рекомендаций — товаров, которые могут заинтересовать его. В магазинах, использующих технологию RFID, планируется вводить аналогичные сервисы.[1]'
        },
        {
          title: 'Пользовательское соглашение',
          isActive: false,
          content: 'Программа лояльности — комплекс маркетинговых мероприятий для развития повторных продаж существующим клиентам в будущем, продажи им дополнительных товаров и услуг, продвижения корпоративных идей и ценностей, других видов потенциально прибыльного поведения. Проводится, в основном, на этапе зрелости жизненного цикла товара. Типичным примером программы лояльности компании является дисконтная карта, при дальнейших покупках с использованием дисконтной карты могут предоставляться скидки, в том числе по накопительной системе, также могут существовать системы бонусов и подарков. Кроме того, при получении подобных карт, как правило, заполняется анкета, в которой указываются контакты получателя, что даёт организации возможность оповещать покупателя о новых и потенциально интересующих его товарах и услугах. Для автоматизированного анализа клиентского поведения и управления используются CRM-системы. При глубинном анализе данных о покупках, совершаемых клиентом, возможно выявление товаров и услуг, в которых потенциально заинтересован клиент. Например, онлайн-магазин на основании анализа покупок клиента может показывать авторизованному пользователю список рекомендаций — товаров, которые могут заинтересовать его. В магазинах, использующих технологию RFID, планируется вводить аналогичные сервисы.[1]'
        },
        {
          title: 'Политика конфеденциальности',
          isActive: false,
          content: 'Программа лояльности — комплекс маркетинговых мероприятий для развития повторных продаж существующим клиентам в будущем, продажи им дополнительных товаров и услуг, продвижения корпоративных идей и ценностей, других видов потенциально прибыльного поведения. Проводится, в основном, на этапе зрелости жизненного цикла товара. Типичным примером программы лояльности компании является дисконтная карта, при дальнейших покупках с использованием дисконтной карты могут предоставляться скидки, в том числе по накопительной системе, также могут существовать системы бонусов и подарков. Кроме того, при получении подобных карт, как правило, заполняется анкета, в которой указываются контакты получателя, что даёт организации возможность оповещать покупателя о новых и потенциально интересующих его товарах и услугах. Для автоматизированного анализа клиентского поведения и управления используются CRM-системы. При глубинном анализе данных о покупках, совершаемых клиентом, возможно выявление товаров и услуг, в которых потенциально заинтересован клиент. Например, онлайн-магазин на основании анализа покупок клиента может показывать авторизованному пользователю список рекомендаций — товаров, которые могут заинтересовать его. В магазинах, использующих технологию RFID, планируется вводить аналогичные сервисы.[1]'
        },
        {
          title: 'Политика использование cookies',
          isActive: false,
          content: 'Программа лояльности — комплекс маркетинговых мероприятий для развития повторных продаж существующим клиентам в будущем, продажи им дополнительных товаров и услуг, продвижения корпоративных идей и ценностей, других видов потенциально прибыльного поведения. Проводится, в основном, на этапе зрелости жизненного цикла товара. Типичным примером программы лояльности компании является дисконтная карта, при дальнейших покупках с использованием дисконтной карты могут предоставляться скидки, в том числе по накопительной системе, также могут существовать системы бонусов и подарков. Кроме того, при получении подобных карт, как правило, заполняется анкета, в которой указываются контакты получателя, что даёт организации возможность оповещать покупателя о новых и потенциально интересующих его товарах и услугах. Для автоматизированного анализа клиентского поведения и управления используются CRM-системы. При глубинном анализе данных о покупках, совершаемых клиентом, возможно выявление товаров и услуг, в которых потенциально заинтересован клиент. Например, онлайн-магазин на основании анализа покупок клиента может показывать авторизованному пользователю список рекомендаций — товаров, которые могут заинтересовать его. В магазинах, использующих технологию RFID, планируется вводить аналогичные сервисы.[1]'
        }
      ]
    }
  },
  computed: {

  },
  methods: {
    listOpen (ind) {
      this.list[ind].isActive = !this.list[ind].isActive
    }
  }
}
</script>

<style scoped>
  #main-app {
    width: 100%;
    background: #fff;
    padding: 60px 30px;
    margin-top: 30px;
    border-radius: 12px;
  }
  .main-app-item-1 {
    display: flex;
    align-items: center;
    width: 400px;
    justify-content: space-between;
    cursor: pointer;
    margin: 15px 0px;
  }
  .main-app-item-title {
    font-size: 20px;
    font-family: PT Sans, sans-serif;
    color:#707070;
  }
  .modale-wrong-item-add {
    color:#707070;
    font-weight: bold;
    margin: 0;
    font-family: PT Sans, sans-serif;
    font-size: 30px;
    line-height: 0px;
    pointer-events: none;
  }
  .slide-enter-active{
    animation: slideIn 0.3s;
  }
  .slide-leave-active{
    animation: slideOut 0.3s;
  }
  .main-app-item-2 {
    height: 300px;
    border:1px solid #707070;
    border-radius: 12px;
    overflow-y: scroll;
  }
  .main-app-item-2 p {
    margin: 0;
    font-family: PT Sans, sans-serif;
    font-size: 20px;
    color:#707070;
    padding: 10px 15px;
  }
  .main-app-item-2::-webkit-scrollbar-button {
    background-image:url('');
    background-repeat:no-repeat;
    width:15px;
    height:0px
  }
  .main-app-item-2::-webkit-scrollbar-track {

  }
  .main-app-item-2::-webkit-scrollbar-thumb {
    border-radius: 12px;
    background:url("../assets/scrollbar.png") 50% 50% no-repeat;
  }
  .main-app-item-2::-webkit-resizer{
    background-image:url('');
    background-repeat:no-repeat;
    width:14px;
    height:0px
  }
  .main-app-item-2::-webkit-scrollbar{
    width: 24px;
    border-left:1px solid #707070;
    padding-left: 10px;
    border-radius: 0px;
  }
  @keyframes slideIn{
    from{opacity: 0}
    to{opacity: 1}
  }
  @keyframes slideOut{
    from{opacity: 1}
    to{opacity: 0}
  }
  @media screen and (max-width: 1100px) {
    #main-app {
      margin: 0px;
      border-radius:0px;
    }
  }
  @media screen and (max-width: 500px) {
    .main-app-item-2 {
      width: 100%;
    }
    .main-app-item-1 {
      width: 100%;
    }
    .main-app-item-title {
      margin-right: 10px;
    }
  }
</style>
