// Главный сайт, на который будет редирект
let official = 'https://yandex.ru/'

// Время, через которое появляется крестик (Указывать в ms - 1000 = 1 секунда)
let closeTimeout = 3000

// Время, через которое меняется кнопка ("LOOK" => "Я уже посмотрел")
let btnTimeout = 5000

    // Документ, который скачивается по умолчанию, лежит в папке с index.html и называется "price.xlsx"

    // Все тексты можно менять выше

    // Картинка, которая отображается на фоне, также лежит в папке с index.html и называется "main-bg.png"
    // при необходимости её можно поменять выше. Размылена она средствами css, в фотошопе можно не размыливать
